EDT/УТ/src/Documents/мгТарифыДляРасчетаФОТНадбавкиПереработкиПремия/мгТарифыДляРасчетаФОТНадбавкиПереработкиПремия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>мгТарифыДляРасчетаФОТНадбавкиПереработкиПремия</name>
  <comment>(Миго-групп)</comment>
  <registerRecords>InformationRegister.мгТарифыНадбавки</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТарифыНачислений</name>
    <attributes>
      <name>Начисления</name>
      <comment>(Миго-групп)</comment>
      <type>
        <types>CatalogRef.мгНачисленияУдержания</types>
      </type>
    </attributes>
    <attributes>
      <name>Тариф</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/InformationRegisters/мгТарифыНадбавки/мгТарифыНадбавки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>мгТарифыНадбавки</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Тариф</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Начисление</name>
    <type>
      <types>CatalogRef.мгНачисленияУдержания</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Documents/мгТарифыДляРасчетаФОТНадбавкиПереработкиПремия/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр мгТарифыФОТ
	Движения.мгТарифыНадбавки.Записывать = Истина;
	Движения.мгТарифыНадбавки.Очистить();
	Для Каждого ТекСтрокаТарифыНачислений Из ТарифыНачислений Цикл
		Движение = Движения.мгТарифыНадбавки.Добавить();
		Движение.Период = Дата;
		Движение.Начисление = ТекСтрокаТарифыНачислений.Начисления;
		Движение.Тариф = ТекСтрокаТарифыНачислений.Тариф;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
